Repository: sudhaus7/typo3-xlsimport
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

source: Choose page
de: Seite auswählen

# choosepage_info
source: Before continuing, you have to choose a page on the left.
de: Sie müssen links eine Seite auswählen, um fortfahren zu können.

# importinfo
source: Import Excel
de: Excel importieren

# importinfo_format
source: You can import from following formats:
de: Sie können folgende Formate importieren:

# tableselect
source: Select a table importing to
de: Tabelle zum Importieren auswählen

# fileselect
source: Select a file
de: Datei auswählen

source: Upload
de: Hochladen

# prepare
source: Prepare data
de: Daten vorbereiten

# prepareinfo
source: Prepare Excel
de: Excel vorbereiten

# prepareinfo_text
source: Select the structure for the table
de: Wählen Sie die Struktur für die Tabelle aus

# importinfo_text
source: Select the records to import
de: Wählen Sie die zu importierenden Datensätze aus

# record
source: Import record
de: Datensatz importieren

source: ignore
de: ignorieren

# multiple
source: Select default values for multiple fields
de: Standardwerte für Multifelder auswählen

source: Import
de: Importieren

# success
source: Data imported successfully
de: Daten erfolgreich importiert

# complete
source: Completed
de: Abgeschlosssen

# info_complete
source: Total datasets to import
de: Anzahl gesamte Datensätze zum importieren

# encoding
source: Only for CSV files: file is CP1252 encoded (e.g. Excel export)
de: Nur für CSV Dateien: Datei ist CP1252 kodiert (z. B. Excel-Export)

# deleteRecord
source: Delete all records according to this table on current page?
de: Alle Datensätze dieser Tabelle auf der aktuellen Seite löschen?

# overridePassword
source: Override password with random values?
de: Passwort mit Zufallswerten befüllen?

# pid
source: Page ID [pid]
de: Seiten ID [pid]

source: Allowed tables
de: Erlaubte Tabellen

# warning.fieldlist.empty.header
source: Empty field list
de: Leere Feldliste

# warning.fieldlist.empty.message
source: You didn't choose any fields to map. Please correct in dropdowns below and submit again.
de: Sie haben keine Felder zugeordnet. Bitte korrigieren Sie das in den Auswahlfeldern und senden das Formular erneut ab.

# error.file.uploadFailed.header
source: File upload failed
de: Datei hochladen fehlgeschlagen

# error.file.uploadFailed.message
source: Something went wrong during the upload. Please try again.
de: Beim Hochladen ist etwas schiefgelaufen. Bitte versuchen Sie es erneut.

# error.jsonFile.header
source: Temporarily saved file not found
de: Temporäre Datei nicht gefunden

# error.jsonFile.message
source: The temporarily saved file was not found. Please try again with upload your data.
de: Die temporär gespeicherte Datei konnte nicht geladen werden. Bitte versuchen Sie einen erneuten Upload.

# uploadForm.no_allowed_tables_available_title
source: Incomplete configuration
de: Unvollständige Konfiguration

# uploadForm.no_allowed_tables_available_message
source: No allowed tables for import configured. Refer documentation for required PageTSConfig configuration.
de: Es wurden keine Tabellen für den Import freigegeben. Bitte schaue in die Dokumentation für die notwendige PageTSConfig Konfiguration.
